workloads/YCSB_rocksdb/luma_test_logs/record_size_workloadA_logs/scxfs_8dev_4KB
<YCSB RocksDB benchmark script>
load YCSB-a x1 & run YCSB-a x10..
*---------------------------------- ycsb load ----------------------------------*
[OVERALL], RunTime(ms), 69262
[OVERALL], Throughput(ops/sec), 73922.20842597673
[TOTAL_GCS_G1_Young_Generation], Count, 84
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 343
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.4952210447287113
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 84
[TOTAL_GC_TIME], Time(ms), 343
[TOTAL_GC_TIME_%], Time(%), 0.4952210447287113
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 12665.1875
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 810495
[CLEANUP], 95thPercentileLatency(us), 11
[CLEANUP], 99thPercentileLatency(us), 80
[INSERT], Operations, 5120000
[INSERT], AverageLatency(us), 836.205866796875
[INSERT], MinLatency(us), 19
[INSERT], MaxLatency(us), 39103
[INSERT], 95thPercentileLatency(us), 1007
[INSERT], 99thPercentileLatency(us), 1650
[INSERT], Return=OK, 5120000
*---------------------------------- ycsb load end ------------------------------*
*---------------------------------- ycsb run_1 ----------------------------------*
[OVERALL], RunTime(ms), 95214
[OVERALL], Throughput(ops/sec), 53773.60472199466
[TOTAL_GCS_G1_Young_Generation], Count, 110
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 454
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.47682063562081206
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 110
[TOTAL_GC_TIME], Time(ms), 454
[TOTAL_GC_TIME_%], Time(%), 0.47682063562081206
[READ], Operations, 2560610
[READ], AverageLatency(us), 171.89269939584707
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 95743
[READ], 95thPercentileLatency(us), 471
[READ], 99thPercentileLatency(us), 672
[READ], Return=OK, 2560610
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 3137.640625
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 200319
[CLEANUP], 95thPercentileLatency(us), 26
[CLEANUP], 99thPercentileLatency(us), 33
[UPDATE], Operations, 2559390
[UPDATE], AverageLatency(us), 2166.4496368275254
[UPDATE], MinLatency(us), 18
[UPDATE], MaxLatency(us), 111999
[UPDATE], 95thPercentileLatency(us), 9735
[UPDATE], 99thPercentileLatency(us), 40799
[UPDATE], Return=OK, 2559390
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_2 ----------------------------------*
[OVERALL], RunTime(ms), 51555
[OVERALL], Throughput(ops/sec), 99311.41499369605
[TOTAL_GCS_G1_Young_Generation], Count, 63
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 340
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6594898651925128
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 63
[TOTAL_GC_TIME], Time(ms), 340
[TOTAL_GC_TIME_%], Time(%), 0.6594898651925128
[READ], Operations, 2561199
[READ], AverageLatency(us), 186.223813534208
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 35775
[READ], 95thPercentileLatency(us), 573
[READ], 99thPercentileLatency(us), 996
[READ], Return=OK, 2561199
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 1612.375
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 102847
[CLEANUP], 95thPercentileLatency(us), 18
[CLEANUP], 99thPercentileLatency(us), 20
[UPDATE], Operations, 2558801
[UPDATE], AverageLatency(us), 1064.822799037518
[UPDATE], MinLatency(us), 17
[UPDATE], MaxLatency(us), 40127
[UPDATE], 95thPercentileLatency(us), 1353
[UPDATE], 99thPercentileLatency(us), 17999
[UPDATE], Return=OK, 2558801
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_3 ----------------------------------*
[OVERALL], RunTime(ms), 50121
[OVERALL], Throughput(ops/sec), 102152.7902476008
[TOTAL_GCS_G1_Young_Generation], Count, 61
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 333
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6643921709463099
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 61
[TOTAL_GC_TIME], Time(ms), 333
[TOTAL_GC_TIME_%], Time(%), 0.6643921709463099
[READ], Operations, 2561073
[READ], AverageLatency(us), 202.63609041991384
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 27055
[READ], 95thPercentileLatency(us), 594
[READ], 99thPercentileLatency(us), 845
[READ], Return=OK, 2561073
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 6633.328125
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 424191
[CLEANUP], 95thPercentileLatency(us), 16
[CLEANUP], 99thPercentileLatency(us), 71
[UPDATE], Operations, 2558927
[UPDATE], AverageLatency(us), 1006.8814378057679
[UPDATE], MinLatency(us), 16
[UPDATE], MaxLatency(us), 33759
[UPDATE], 95thPercentileLatency(us), 1371
[UPDATE], 99thPercentileLatency(us), 12831
[UPDATE], Return=OK, 2558927
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_4 ----------------------------------*
[OVERALL], RunTime(ms), 58540
[OVERALL], Throughput(ops/sec), 87461.56474205671
[TOTAL_GCS_G1_Young_Generation], Count, 71
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 353
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6030064912880082
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 71
[TOTAL_GC_TIME], Time(ms), 353
[TOTAL_GC_TIME_%], Time(%), 0.6030064912880082
[READ], Operations, 2560826
[READ], AverageLatency(us), 204.62261200097157
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 27423
[READ], 95thPercentileLatency(us), 587
[READ], 99thPercentileLatency(us), 874
[READ], Return=OK, 2560826
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 884.84375
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 56191
[CLEANUP], 95thPercentileLatency(us), 22
[CLEANUP], 99thPercentileLatency(us), 28
[UPDATE], Operations, 2559174
[UPDATE], AverageLatency(us), 1225.6986758227458
[UPDATE], MinLatency(us), 17
[UPDATE], MaxLatency(us), 48287
[UPDATE], 95thPercentileLatency(us), 1748
[UPDATE], 99thPercentileLatency(us), 21791
[UPDATE], Return=OK, 2559174
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_5 ----------------------------------*
[OVERALL], RunTime(ms), 53321
[OVERALL], Throughput(ops/sec), 96022.20513493745
[TOTAL_GCS_G1_Young_Generation], Count, 71
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 344
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.645149190750361
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 71
[TOTAL_GC_TIME], Time(ms), 344
[TOTAL_GC_TIME_%], Time(%), 0.645149190750361
[READ], Operations, 2559176
[READ], AverageLatency(us), 245.31857480689098
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 17903
[READ], 95thPercentileLatency(us), 719
[READ], 99thPercentileLatency(us), 1013
[READ], Return=OK, 2559176
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 13525.296875
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 865279
[CLEANUP], 95thPercentileLatency(us), 28
[CLEANUP], 99thPercentileLatency(us), 52
[UPDATE], Operations, 2560824
[UPDATE], AverageLatency(us), 1028.5190200497964
[UPDATE], MinLatency(us), 15
[UPDATE], MaxLatency(us), 33599
[UPDATE], 95thPercentileLatency(us), 1624
[UPDATE], 99thPercentileLatency(us), 10671
[UPDATE], Return=OK, 2560824
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_6 ----------------------------------*
[OVERALL], RunTime(ms), 63652
[OVERALL], Throughput(ops/sec), 80437.37824420285
[TOTAL_GCS_G1_Young_Generation], Count, 73
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 326
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5121598692892604
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 73
[TOTAL_GC_TIME], Time(ms), 326
[TOTAL_GC_TIME_%], Time(%), 0.5121598692892604
[READ], Operations, 2557986
[READ], AverageLatency(us), 284.5576977356405
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 25263
[READ], 95thPercentileLatency(us), 894
[READ], 99thPercentileLatency(us), 1343
[READ], Return=OK, 2557986
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 3411.1875
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 217855
[CLEANUP], 95thPercentileLatency(us), 18
[CLEANUP], 99thPercentileLatency(us), 126
[UPDATE], Operations, 2562014
[UPDATE], AverageLatency(us), 1266.6452369112737
[UPDATE], MinLatency(us), 16
[UPDATE], MaxLatency(us), 49375
[UPDATE], 95thPercentileLatency(us), 2087
[UPDATE], 99thPercentileLatency(us), 21951
[UPDATE], Return=OK, 2562014
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_7 ----------------------------------*
[OVERALL], RunTime(ms), 56317
[OVERALL], Throughput(ops/sec), 90913.9336257258
[TOTAL_GCS_G1_Young_Generation], Count, 73
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 343
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6090523287817178
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 73
[TOTAL_GC_TIME], Time(ms), 343
[TOTAL_GC_TIME_%], Time(%), 0.6090523287817178
[READ], Operations, 2560305
[READ], AverageLatency(us), 198.9526954796401
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 25695
[READ], 95thPercentileLatency(us), 594
[READ], 99thPercentileLatency(us), 948
[READ], Return=OK, 2560305
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 810.765625
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 51551
[CLEANUP], 95thPercentileLatency(us), 14
[CLEANUP], 99thPercentileLatency(us), 33
[UPDATE], Operations, 2559695
[UPDATE], AverageLatency(us), 1171.485496514233
[UPDATE], MinLatency(us), 17
[UPDATE], MaxLatency(us), 50431
[UPDATE], 95thPercentileLatency(us), 1817
[UPDATE], 99thPercentileLatency(us), 21311
[UPDATE], Return=OK, 2559695
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_8 ----------------------------------*
[OVERALL], RunTime(ms), 51195
[OVERALL], Throughput(ops/sec), 100009.76657876746
[TOTAL_GCS_G1_Young_Generation], Count, 69
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 339
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6621740404336361
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 69
[TOTAL_GC_TIME], Time(ms), 339
[TOTAL_GC_TIME_%], Time(%), 0.6621740404336361
[READ], Operations, 2561193
[READ], AverageLatency(us), 217.44044943118305
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 29903
[READ], 95thPercentileLatency(us), 646
[READ], 99thPercentileLatency(us), 904
[READ], Return=OK, 2561193
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 13325.953125
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 852479
[CLEANUP], 95thPercentileLatency(us), 31
[CLEANUP], 99thPercentileLatency(us), 117
[UPDATE], Operations, 2558807
[UPDATE], AverageLatency(us), 1007.9972881893789
[UPDATE], MinLatency(us), 17
[UPDATE], MaxLatency(us), 33823
[UPDATE], 95thPercentileLatency(us), 1405
[UPDATE], 99thPercentileLatency(us), 12647
[UPDATE], Return=OK, 2558807
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_9 ----------------------------------*
[OVERALL], RunTime(ms), 62128
[OVERALL], Throughput(ops/sec), 82410.5073396858
[TOTAL_GCS_G1_Young_Generation], Count, 71
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 316
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5086273499871233
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 71
[TOTAL_GC_TIME], Time(ms), 316
[TOTAL_GC_TIME_%], Time(%), 0.5086273499871233
[READ], Operations, 2558693
[READ], AverageLatency(us), 226.15580024645396
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 32495
[READ], 95thPercentileLatency(us), 685
[READ], 99thPercentileLatency(us), 1294
[READ], Return=OK, 2558693
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 3413.390625
[CLEANUP], MinLatency(us), 3
[CLEANUP], MaxLatency(us), 217983
[CLEANUP], 95thPercentileLatency(us), 19
[CLEANUP], 99thPercentileLatency(us), 25
[UPDATE], Operations, 2561307
[UPDATE], AverageLatency(us), 1285.642426308131
[UPDATE], MinLatency(us), 15
[UPDATE], MaxLatency(us), 50175
[UPDATE], 95thPercentileLatency(us), 1989
[UPDATE], 99thPercentileLatency(us), 22111
[UPDATE], Return=OK, 2561307
*---------------------------------- ycsb run end ------------------------------*
*---------------------------------- ycsb run_10 ----------------------------------*
[OVERALL], RunTime(ms), 50715
[OVERALL], Throughput(ops/sec), 100956.32455880904
[TOTAL_GCS_G1_Young_Generation], Count, 71
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 339
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6684412895593019
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 71
[TOTAL_GC_TIME], Time(ms), 339
[TOTAL_GC_TIME_%], Time(%), 0.6684412895593019
[READ], Operations, 2561270
[READ], AverageLatency(us), 219.29363128447997
[READ], MinLatency(us), 2
[READ], MaxLatency(us), 22927
[READ], 95thPercentileLatency(us), 646
[READ], 99thPercentileLatency(us), 880
[READ], Return=OK, 2561270
[CLEANUP], Operations, 64
[CLEANUP], AverageLatency(us), 6163.890625
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 393983
[CLEANUP], 95thPercentileLatency(us), 28
[CLEANUP], 99thPercentileLatency(us), 69
[UPDATE], Operations, 2558730
[UPDATE], AverageLatency(us), 1001.9090564459713
[UPDATE], MinLatency(us), 17
[UPDATE], MaxLatency(us), 33823
[UPDATE], 95thPercentileLatency(us), 1408
[UPDATE], 99thPercentileLatency(us), 12711
[UPDATE], Return=OK, 2558730
*---------------------------------- ycsb run end ------------------------------*
experiment end.